particle-iot/device-os/hal/src/nRF52840/i2c_hal.cpp
    if (twiUninit(i2c) == SYSTEM_ERROR_NONE) {
        i2cMap[i2c].state = HAL_I2C_STATE_DISABLED;
    }

    if (i2cMap[i2c].state == HAL_I2C_STATE_DISABLED) {
        i2cMap[i2c].rx_index_head = 0;
        i2cMap[i2c].rx_index_tail = 0;
        i2cMap[i2c].tx_index_head = 0;
        i2cMap[i2c].tx_index_tail = 0;
        memset((void *)i2cMap[i2c].rx_buf, 0, i2cMap[i2c].rx_buf_size);
        memset((void *)i2cMap[i2c].tx_buf, 0, i2cMap[i2c].tx_buf_size);
    }

    i2cMap[i2c].mode = mode;
    i2cMap[i2c].address = address;

    if (i2cMap[i2c].state != HAL_I2C_STATE_ENABLED && twiInit(i2c) == SYSTEM_ERROR_NONE) {
        i2cMap[i2c].state = HAL_I2C_STATE_ENABLED;
    }
}

void hal_i2c_end(hal_i2c_interface_t i2c, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return;
    }

    I2cLock lk(i2c);
    if (hal_i2c_is_enabled(i2c, nullptr)) {
        if (twiUninit(i2c) == SYSTEM_ERROR_NONE) {
            i2cMap[i2c].state = HAL_I2C_STATE_DISABLED;
        }
    }
}

uint32_t hal_i2c_request(hal_i2c_interface_t i2c, uint8_t address, uint8_t quantity, uint8_t stop, void* reserved) {
    hal_i2c_transmission_config_t conf = {
        .size = sizeof(hal_i2c_transmission_config_t),
        .version = 0,
        .address = address,
        .reserved = {0},
        .quantity = quantity,
        .timeout_ms = HAL_I2C_DEFAULT_TIMEOUT_MS,
        .flags = (uint32_t)(stop ? HAL_I2C_TRANSMISSION_FLAG_STOP : 0)
    };
    return hal_i2c_request_ex(i2c, &conf, nullptr);
}

int32_t hal_i2c_request_ex(hal_i2c_interface_t i2c, const hal_i2c_transmission_config_t* config, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM || !hal_i2c_is_enabled(i2c, nullptr)) {
        return 0;
    }

    I2cLock lk(i2c);
    uint32_t ret;
    size_t quantity = 0;

    if (!config) {
        goto ret;
    }

    quantity = config->quantity;

    // clamp to buffer length
    if (quantity > i2cMap[i2c].rx_buf_size) {
        quantity = i2cMap[i2c].rx_buf_size;
    }

    i2cMap[i2c].transfer_state = TRANSFER_STATE_BUSY;
    ret = nrfx_twim_rx(i2cMap[i2c].master, config->address, (uint8_t *)i2cMap[i2c].rx_buf, quantity);
    if (ret) {
        // FIXME: There is a bug in nrfx_twim driver, if we call nrfx_twim_rx repeatedly and quickly,
        // p_cb->busy will be set and never cleared, in this case nrfx_twim_rx always returns busy error
        LOG_DEBUG(TRACE, "BUSY ERROR, restore twi.");
        hal_i2c_reset(i2c, 0, nullptr);
        quantity = 0;
        goto ret;
    }

    if (!WAIT_TIMED(config->timeout_ms, i2cMap[i2c].transfer_state == TRANSFER_STATE_BUSY)) {
        hal_i2c_reset(i2c, 0, nullptr);
        quantity = 0;
        goto ret;
    }

    if (i2cMap[i2c].transfer_state != TRANSFER_STATE_IDLE) {
        // Get into error state
        hal_i2c_reset(i2c, 0, nullptr);
        quantity = 0;
        goto ret;
    }

ret:
    i2cMap[i2c].transfer_state = TRANSFER_STATE_IDLE;
    i2cMap[i2c].rx_index_head = 0;
    i2cMap[i2c].rx_index_tail = quantity;
    return quantity;
}

void hal_i2c_begin_transmission(hal_i2c_interface_t i2c, uint8_t address, const hal_i2c_transmission_config_t* config) {
    if (i2c >= HAL_PLATFORM_I2C_NUM || !hal_i2c_is_enabled(i2c, nullptr)) {
        return;
    }

    I2cLock lk(i2c);
    i2cMap[i2c].address = address;
    i2cMap[i2c].tx_index_head = 0;
    i2cMap[i2c].tx_index_tail = 0;
    setConfigOrDefault(i2c, config);
}

uint8_t hal_i2c_end_transmission(hal_i2c_interface_t i2c, uint8_t stop, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return 6;
    }
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return 7;
    }

    I2cLock lk(i2c);

    uint32_t ret;
    uint8_t ret_code = 0;

    if (i2cMap[i2c].transfer_config.address != 0xff) {
        stop = i2cMap[i2c].transfer_config.flags & HAL_I2C_TRANSMISSION_FLAG_STOP;
    }

    i2cMap[i2c].transfer_state = TRANSFER_STATE_BUSY;
    ret = nrfx_twim_tx(i2cMap[i2c].master, i2cMap[i2c].address, (uint8_t *)i2cMap[i2c].tx_buf,
                                    i2cMap[i2c].tx_index_tail, !stop);
    if (ret) {
        hal_i2c_reset(i2c, 0, nullptr);
        ret_code = 1;
        goto ret;
    }

    if (!WAIT_TIMED(i2cMap[i2c].transfer_config.timeout_ms, i2cMap[i2c].transfer_state == TRANSFER_STATE_BUSY)) {
        hal_i2c_reset(i2c, 0, nullptr);
        ret_code = 2;
        goto ret;
    }

    if (i2cMap[i2c].transfer_state != TRANSFER_STATE_IDLE) {
        hal_i2c_reset(i2c, 0, nullptr);
        ret_code = 3;
        goto ret;
    }

ret:
    i2cMap[i2c].transfer_state = TRANSFER_STATE_IDLE;
    i2cMap[i2c].tx_index_head = 0;
    i2cMap[i2c].tx_index_tail = 0;
    return ret_code;
}

uint32_t hal_i2c_write(hal_i2c_interface_t i2c, uint8_t data, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM || !hal_i2c_is_enabled(i2c, nullptr)) {
        return 0;
    }

    I2cLock lk(i2c);
    // in master/slave transmitter mode
    // don't bother if buffer is full
    if (i2cMap[i2c].tx_index_tail >= i2cMap[i2c].tx_buf_size) {
        return 0;
    }
    // put byte in tx buffer
    i2cMap[i2c].tx_buf[i2cMap[i2c].tx_index_head++] = data;
    // update amount in buffer
    i2cMap[i2c].tx_index_tail = i2cMap[i2c].tx_index_head;

    return 1;
}

int32_t hal_i2c_available(hal_i2c_interface_t i2c, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return 0;
    }

    I2cLock lk(i2c);
    int32_t available = i2cMap[i2c].rx_index_tail - i2cMap[i2c].rx_index_head;
    return available;
}

int32_t hal_i2c_read(hal_i2c_interface_t i2c, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return -1;
    }

    I2cLock lk(i2c);
    int value = -1;
    // get each successive byte on each call
    if (i2cMap[i2c].rx_index_head < i2cMap[i2c].rx_index_tail) {
        value = i2cMap[i2c].rx_buf[i2cMap[i2c].rx_index_head++];
    }
    return value;
}

int32_t hal_i2c_peek(hal_i2c_interface_t i2c, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return -1;
    }

    I2cLock lk(i2c);
    int value = -1;
    if(i2cMap[i2c].rx_index_head < i2cMap[i2c].rx_index_tail) {
        value = i2cMap[i2c].rx_buf[i2cMap[i2c].rx_index_head];
    }
    return value;
}

void hal_i2c_flush(hal_i2c_interface_t i2c, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return;
    }
    I2cLock lk(i2c);
    i2cMap[i2c].rx_index_head = 0;
    i2cMap[i2c].rx_index_tail = 0;
    i2cMap[i2c].tx_index_head = 0;
    i2cMap[i2c].tx_index_tail = 0;
}

bool hal_i2c_is_enabled(hal_i2c_interface_t i2c,void* reserved) {
    return i2cMap[i2c].state == HAL_I2C_STATE_ENABLED;
}

void hal_i2c_set_callback_on_received(hal_i2c_interface_t i2c, void (*function)(int),void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return;
    }

    I2cLock lk(i2c);
    i2cMap[i2c].callback_on_receive = function;
}

void hal_i2c_set_callback_on_requested(hal_i2c_interface_t i2c, void (*function)(void),void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return;
    }
    
    I2cLock lk(i2c);
    i2cMap[i2c].callback_on_request = function;
}

void hal_i2c_enable_dma_mode(hal_i2c_interface_t i2c, bool enable,void* reserved) {
    // use DMA to send data by default
}

uint8_t hal_i2c_reset(hal_i2c_interface_t i2c, uint32_t reserved, void* reserved1) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return 1;
    }

    I2cLock lk(i2c);
    if (!hal_i2c_is_enabled(i2c, nullptr) || (i2cMap[i2c].mode != I2C_MODE_MASTER)) {
        return 1;
    }

    // Important: we keep GPIO configuration intact
    if (twiUninit(i2c, false) == SYSTEM_ERROR_NONE) {
        i2cMap[i2c].state = HAL_I2C_STATE_DISABLED;
    }

